first_routes_and__controllers/app/controllers/artworks_controller.rb

      def index
            #render plain: "I'm in the index section, help me please!?!?"
            render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"