first_routes_and__controllers/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def index
            #render plain: "I'm in the index section, help me please!?!?"
            # render json: Artwork.all (old way)

            u = User.find(params[:user_id])

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "I made this I swear"], ["image_url", "google.com"], ["artist_id", 16]]
---
      def create
            #render json: params
            artwork = Artwork.new(artwork_params)
            if artwork.save!

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "I made this I swear"], ["id", 40]]
---
      def update
            @artwork = Artwork.find(params[:id])
            @artwork.update!(artwork_params)

DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 42]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
      def destroy
            render json: Artwork.find(params[:id]).destroy