first_routes_and__controllers/app/controllers/artwork_shares_controller.rb

def index
        #render plain: "I'm in the index section, help me please!?!?"
        render json: ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

  def show
        @artwork_share = ArtworkShare.find(params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
        render json: ArtworkShare.find(params[:id]).destroy
---
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 32]]
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]