first_routes_and__controllers/app/controllers/comments_controller.rb

      def index
            result = []
            if params[:user_id] && params[:artwork_id]
                  u = User.find(params[:user_id])
                  a = Artwork.find(params[:artwork_id])
                  result << "Comments on #{a.title} by #{u.username}"
                  result << a.comments.where('user_id = (?)', params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 43]]