first_routes_and__controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE ('gabe'))
SELECT "users".* FROM "users"
---
      def index
            #render plain: "I'm in the index section, help me please!?!?"
            if params[:query]
                  @users = User.where('username LIKE (?)', '%' + params[:query] + '%')
                  render :index
            else
                  @users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Apple"], ["created_at", "2022-05-05 18:32:37.110180"], ["updated_at", "2022-05-05 18:32:37.110180"]]
---
      def create
            #render json: params
            #render json: 'creating user'
            @user = User.new(user_params)
            if @user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 128], ["LIMIT", 1]]
UPDATE "users" SET "favorite_color" = $1, "description" = $2, "birthyear" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["favorite_color", "Blue"], ["description", "Dumb   An amazing partner and an even better friend\r\n      "], ["birthyear", 2002], ["updated_at", "2022-05-05 19:11:25.792579"], ["id", 129]]
---
      def update
            @user = User.find(params[:id])
            @user.update!(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
---
      def destroy
            render json: User.find(params[:id]).destroy

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 116], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 102], ["LIMIT", 1]]
---
      def liked_artworks
            render json: User.find(params[:id]).liked_artworks

INSERT INTO "likes" ("liker_id", "likeable_id", "likeable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["liker_id", 63], ["likeable_id", 93], ["likeable_type", "Artwork"], ["created_at", "2022-05-05 15:20:01.147837"], ["updated_at", "2022-05-05 15:20:01.147837"]]
---
      def like_artwork
            l = Like.new(likeable_type: 'Artwork', likeable_id: params[:artwork_id], liker_id: params[:id])
            if l.save!

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite_of_artist" = $1 WHERE "artworks"."id" = $2  [["favorite_of_artist", true], ["id", 116]]
---
      def favorite
            a = Artwork.find(params[:art_id])
            if params[:id].to_i == a.artist_id
                  new_value = a.favorite_of_artist ? false : true
                  a.update!(favorite_of_artist: new_value)

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE (viewer_id = ('102')) AND (artwork_id = ('113')) ORDER BY "artwork_shares"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite_of_sharer" = $1 WHERE "artwork_shares"."id" = $2  [["favorite_of_sharer", true], ["id", 201]]
---
      def favorite_share
            a = ArtworkShare.where('viewer_id = (?)', params[:id]).where('artwork_id = (?)', params[:art_id]).first
            if a
                  a.update!(favorite_of_sharer: a.favorite_of_sharer ? false : true)